$(() => {
  loadData()
  
  //---------------------------------------- Points
  points = {
    trickster: 20,
    pyromancer: 20,
    devastator: 20,
    technomancer: 20
  }
  $("#points").text(19)
  
  //---------------------------------------- Load URL Params
  url = {
    trickster: [],
    pyromancer: [],
    devastator: [],
    technomancer: []
  }
  power = {
    trickster: [],
    pyromancer: [],
    devastator: [],
    technomancer: []
  }

  let search = new URLSearchParams(location.search)
  active = url.hasOwnProperty(search.get("c")) ? search.get("c") : "technomancer"
  $("#nav .button[data-class=" + active + "]").addClass("active")
  activetree = $("." + active + ".skilltree").show()
  activestats = $("." + active + ".statstable").show()
  
  let p = search.get("p")
  if (p) {
    $.each(p.split(",").map(Number), (i, n) => {
      $(".power[data-i=" + n + "]", activestats).addClass("active")
      power[active].push(n)
    })
  }
  
  let s = search.get("s") || "A-g"
  //--- URL Backwards Compatability
  if (s.includes(",") || s == "0") {
    s = s.split(",").map(Number)
  }
  else {
    s = decode(s)
  }
  //---
  let l = skills[active].length
  $.each(s, (i, n) => {
    if (n < l) {
      add(n)
    }
  })
  encode()
  
  //---------------------------------------- Bind Elements
  bindElements()
  
  //---------------------------------------- Load Cookies
  $.each(document.cookie.split(";"), (i, s) => {
    let cookie = s.split("=")
    if (+cookie[1]) {
      $("#" + cookie[0].trim()).prop("checked", false).click()
    }
  })
  
  //---------------------------------------- Bread
  //  $("body").append($("<div>").css("position", "relative")
  //    .append($("<img>").attr({ src: "favicon.ico", width: 24, height: 24 }).css({ position: "absolute", top: "600px", right: "1%" })))
})

//---------------------------------------- Add node
function add(id) {
  let node = skills[active][id]
  
  //--- Activate node
  node[0] = 2
  $(".node", activetree).eq(id).removeClass("activatable").addClass("active")
  $("#points").text(--points[active])
  
  //--- Stats
  let stat = node[4]
  $.each(stat, (k, v) => {
    if (stats[active][k][1]) {
      stats[active][k][0] += v
      $(".stat[data-s=\"" + k + "\"] .stat-v", activestats).removeClass("stat-0 stat-1 stat-2 stat-3").addClass("stat-" + Math.floor(stats[active][k][0] / stats[active][k][1] * 3)).text(+(stats[active][k][0] * 100).toFixed(1) + "%")
      $(".stat[data-s=\"" + k + "\"] .stat-c", activestats).text(++stats[active][k][2])
    }
    $(".stat[data-s=\"" + k + "\"]", activestats).removeClass("inactive").show()
  
    //--- Ability Cooldowns
    if (k.startsWith("スキルクールダウン")) {
      let type = k.replace(/スキルクールダウン \((.+?)\)/, "$1")
      cooldowns[type] -= v
      $.each(abilities[active][type], (name, cd) => {
        $(".cooldowns div[data-n=\"" + name + "\"] .cooldown").removeClass("stat-0 stat-1 stat-2 stat-3").addClass("stat-" + Math.floor(stats[active][k][0] / stats[active][k][1] * 3)).text(+(cd * cooldowns[type]).toFixed(1))
      })
    }
  })
  
  //--- Unique Node Skill Count
  if ([ "コンセントレーション", "マグマ・ゴーレム", "アノマリーの恩師", "衝撃増幅器" ].includes(skills[active][id][3])) {
    $(".stat .unique", activestats).attr("data-c", +$(".stat .unique", activestats).attr("data-c") + 1)
    $(".stat .unique", activestats).text(+($(".stat .unique", activestats).attr("data-v") * $(".stat .unique", activestats).attr("data-c") * 100).toFixed(1) + "%")
  }
  
  //--- Sort Stats
  if ($("#sortstats").prop("checked")) {
    sortstats()
  }
  
  //--- Set non-active children to activatable
  $.each(node[2], (i, n) => {
    if (skills[active][n][0] != 2) {
      skills[active][n][0] = 1
      $(".node", activetree).eq(n).addClass("activatable")
    }
  })
  
  //--- Update URL
  url[active].push(id)
  url[active].sort((a, b) => a - b)
}

//---------------------------------------- Remove node
function remove(id) {
  let node = skills[active][id]
  
  //--- Deactivate node
  node[0] = 1
  $(".node", activetree).eq(id).removeClass("active").addClass("activatable")
  $("#points").text(++points[active])
  
  //--- Stats
  let stat = node[4]
  $.each(stat, (k, v) => {
    if (stats[active][k][1]) {
      stats[active][k][0] -= v
      $(".stat[data-s=\"" + k + "\"] .stat-v", activestats).removeClass("stat-0 stat-1 stat-2 stat-3")
      $(".stat[data-s=\"" + k + "\"] .stat-c", activestats).text(--stats[active][k][2])
    }
    if (stats[active][k][0]) {
      $(".stat[data-s=\"" + k + "\"] .stat-v", activestats).addClass("stat-" + Math.floor(stats[active][k][0] / stats[active][k][1] * 3)).text(+(stats[active][k][0] * 100).toFixed(1) + "%")
    }
    else {
      if (!$("#allstats").prop("checked")) {
        $(".stat[data-s=\"" + k + "\"]", activestats).hide()
      }
      $(".stat[data-s=\"" + k + "\"]", activestats).addClass("inactive")
      $(".stat[data-s=\"" + k + "\"] .stat-v", activestats).text("0%")
    }
  
    //--- Ability Cooldowns
    if (k.startsWith("スキルクールダウン")) {
      let type = k.replace(/スキルクールダウン \((.+?)\)/, "$1")
      cooldowns[type] += v
      $.each(abilities[active][type], (name, cd) => {
        $(".cooldowns div[data-n=\"" + name + "\"] .cooldown").removeClass("stat-0 stat-1 stat-2 stat-3").text(+(cd * cooldowns[type]).toFixed(1))
        if (stats[active][k][0]) {
          $(".cooldowns div[data-n=\"" + name + "\"] .cooldown").addClass("stat-" + Math.floor(stats[active][k][0] / stats[active][k][1] * 3))
        }
      })
    }
  })
  
  //--- Unique Node Skill Count
  if ([ "コンセントレーション", "マグマ・ゴーレム", "アノマリーの恩師", "衝撃増幅器" ].includes(skills[active][id][3])) {
    $(".stat .unique", activestats).attr("data-c", +$(".stat .unique", activestats).attr("data-c") - 1)
    $(".stat .unique", activestats).text(+($(".stat .unique", activestats).attr("data-v") * $(".stat .unique", activestats).attr("data-c") * 100).toFixed(1) + "%")
  }
  
  //--- Sort Stats
  if ($("#sortstats").prop("checked")) {
    sortstats()
  }
  
  //--- Get all activatable child nodes
  let children = []
  $.each(node[2], (i, n) => {
    if (skills[active][n][0] == 1) {
      children.push(n)
    }
  })
  
  //--- Set activatable child nodes with no other active parents to inactive
  $.each(children, (i, n) => {
    let x = 1
    $.each(skills[active][n][1], (j, m) => {
      if (skills[active][m][0] == 2) {
        x = 0
        return false
      }
    })
    if (x) {
      skills[active][n][0] = 0
      $(".node", activetree).eq(n).removeClass("activatable")
    }
  })
  
  //--- Update URL
  url[active].splice($.inArray(id, url[active]), 1)
  encode()
}

//---------------------------------------- Check tree
function check(id) {
  tree = [ id ]
  recurse(0)
  tree.shift()
  
  //--- Check for invalid active child node
  let x = 1
  $.each(skills[active][id][2], (i, n) => {
    if (skills[active][n][0] == 2 && !tree.includes(n)) {
      x = 0
      return false
    }
  })
  return x
}

//---------------------------------------- Recurse children
function recurse(id) {
  $.each(skills[active][id][2], (i, n) => {
    if (skills[active][n][0] == 2 && !tree.includes(n)) {
      tree.push(n)
      recurse(n)
    }
  })
}

//---------------------------------------- URL Encode
//--- [MODIFIED] https://coolaj86.com/articles/bigints-and-base64-in-javascript/
function encode() {
  let hex = BigInt("10" + url[active].map(x => x.toString().length == 1 ? "0" + x : x).join("")).toString(16)
  if (hex.length % 2) {
    hex = "0" + hex
  }
  let bin = []
  for (let i = 0; i < hex.length; i += 2) {
    bin.push(String.fromCharCode(parseInt(hex.slice(i, i + 2), 16)))
  }
  bin = btoa(bin.join("")).replace(/\+/g, "-").replace(/\//g, "_").replace(/=/g, "")
  history.replaceState(null, "", "?c=" + active + (url[active].length > 1 ? "&s=" + bin : "") + (power[active].length ? "&p=" + power[active].join(",") : ""))
}

function decode(e) {
  e = e.replace(/-/g, "+").replace(/_/g, "/")
  let r = e % 4
  if (r == 2) {
    e += "=="
  }
  else if (r == 3) {
    e += "="
  }
  
  let bin = atob(e)
  let hex = []
  $.each(bin.split(""), (i, ch) => {
    let h = ch.charCodeAt(0).toString(16)
    if (h.length % 2) {
      h = "0" + h
    }
    hex.push(h)
  })
  
  let str = BigInt("0x" + hex.join("")).toString()
  let arr = []
  for (let i = 0; i < str.length - 1; i += 2) {
    arr.push(+(str[i].toString() + str[i + 1].toString()))
  }
  arr.shift()
  
  return arr
}

//---------------------------------------- Search
function search() {
  $(".node", activetree).removeClass("highlight")
  let s = $("#searchtext").val().toLowerCase()
  if (s) {
    $.each(skills[active], (i, n) => {
      $.each(n[4], (k, v) => {
        if (k.toLowerCase().includes(s)) {
          $(".node", activetree).eq(i).addClass("highlight")
          return false
        }
      })
    })
    $("#searchcount").text("(" + $(".node.highlight", activetree).length + " matches)")
  }
  else {
    $("#searchcount").text("")
  }
}

//---------------------------------------- Sort Stats --- Wow this is ugly
function sortstats() {
  let table = $("table", activestats).first()
  table.children().sort((a, b) => +($(".stat-v", b).attr("class").split(/\s+/)[1] || "-1").replace("stat-", "") - +($(".stat-v", a).attr("class").split(/\s+/)[1] || "-1").replace("stat-", "") || $(a).attr("data-s").localeCompare($(b).attr("data-s"))).appendTo(table)
  table = $("table", activestats).last()
  table.children().sort((a, b) => $(a).hasClass("inactive") - $(b).hasClass("inactive") || $(a).attr("data-s").localeCompare($(b).attr("data-s"))).appendTo(table)
}

//---------------------------------------- Color Keywords
function color(s, keywords) {
  $.each(keywords, (k, v) => {
    if (s.match(v)) {
      s = s.replace(v, "<span class=\"" + k + "\">$1</span>")
    }
  })
  return s
}

//---------------------------------------- Bind Elements
function bindElements() {
  //---------------------------------------- Disable default right-click on image, nodes, powers
  $("img, .node, .power").bind("contextmenu", () => false)
  
  //---------------------------------------- Click node
  $(".node").on("mousedown", function() {
    let id = +$(this).index()
    if (skills[active][id][0] == 1 && points[active] > 0) {
      add(id)
      encode()
    }
    else if (skills[active][id][0] == 2 && id != 0 && check(id)) {
      remove(id)
    }
  })
  
  //---------------------------------------- Reset tree
  $("#reset").on("click", () => {
    //--- Set all nodes to inactive
    $.each(skills[active], (i, s) => s[0] = 0)
    $(".node", activetree).removeClass("active activatable")
    
    //--- Clear stats
    if (!$("#allstats").prop("checked")) {
      $(".stat", activestats).hide()
    }
    $(".stat", activestats).addClass("inactive")
   
    $.each(stats[active], (k, s) => s[0] = s[2] = 0)
    $(".stat .stat-v", activestats).removeClass("stat-0 stat-1 stat-2 stat-3").text("0%")
    $(".stat .stat-c", activestats).text(0)
    
    //--- Unique Node Skill Count
    $(".stat .unique", activestats).attr("data-c", 0).text("0%")
  
    //--- Ability Cooldowns
    $.each(abilities[active], (type, list) => {
      cooldowns[type] = 1
      $.each(list, (name, cd) => {
        $(".cooldowns div[data-n=\"" + name + "\"] .cooldown", activestats).text(cd)
      })
    })
    $(".cooldowns .cooldown", activestats).removeClass("stat-0 stat-1 stat-2 stat-3")
    
    //--- Add node 0
    url[active] = []
    points[active] = 21
    skills[active][0][0] = 1
    add(0)
    encode()
  })
  
  //---------------------------------------- Change Tree
  $("#nav-trickster, #nav-pyromancer, #nav-devastator, #nav-technomancer").on("click", function() {
    activetree.hide()
    activestats.hide()
    $("#searchcount").text("")
    $(".node", activetree).removeClass("highlight")
    $("#nav .button").removeClass("active")
    
    active = $(this).attr("data-class")
    $(this).addClass("active")
    activetree = $("." + active + ".skilltree").show()
    activestats = $("." + active + ".statstable").show()
    
    $("#points").text(points[active])
    if (!url[active].length) {
      add(0)
    }
    encode()
  })
  
  //---------------------------------------- Search
  $("#search .button").on("click", search)
  
  $("#searchtext").keyup(e => {
    if (e.keyCode == 13) {
      search()
    }
  })
  
  //---------------------------------------- Click Powers
  $(".power").on("mousedown", function() {
    let id = +$(this).attr("data-i")
    if ($(this).hasClass("active")) {
      $(this).removeClass("active")
      power[active].splice($.inArray(id, power[active]), 1)
    }
    else if ($(".power.active", activestats).length < 3) {
      $(this).addClass("active")
      power[active].push(id)
      power[active].sort((a, b) => a - b)
    }
    encode()
  })
  
  //---------------------------------------- DPS Calculator
  $("#dps-input input").on("input", () => {
    let clip = +$("#dps-in-clip").val() || 1
    let rpm = +$("#dps-in-rpm").val() || 1
    let dmg = +$("#dps-in-dmg").val() || 0
    let reload = +$("#dps-in-reload").val() || 0
    let crit = (+$("#dps-in-crit").val() || 100) / 100 - 1
    let acc = (+$("#dps-in-acc").val() || 0) / 100
    let rof = rpm / 60
    let dmgcrit = dmg * (1 + crit * acc)
    $("#dps-dmg").text(+dmg.toFixed(1))
    $("#dps-crit").text(+(dmg * (1 + crit)).toFixed(1))
    $("#dps-clip").text(+(dmgcrit * clip).toFixed(1) + " (" + +(clip / rof).toFixed(1) + "s)")
    $("#dps-simple").text(+(dmgcrit * rof).toFixed(1))
    $("#dps-true").text(+((dmgcrit * clip) / (clip / rof + reload)).toFixed(1))
  })
  
  //---------------------------------------- Options
  $("#nodenames").on("click", function() {
    if ($(this).prop("checked")) {
      $(".node .name").show()
      document.cookie = "nodenames=1;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
    else {
      $(".node .name").hide()
      document.cookie = "nodenames=0;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
  })
  
  $("#allstats").on("click", function() {
    if ($(this).prop("checked")) {
      $(".stat.inactive").show()
      document.cookie = "allstats=1;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
    else {
      $(".stat.inactive").hide()
      document.cookie = "allstats=0;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
  })
  
  $("#maxstats").on("click", function() {
    if ($(this).prop("checked")) {
      $(".stat .stat-m").show()
      document.cookie = "maxstats=1;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
    else {
      $(".stat .stat-m").hide()
      document.cookie = "maxstats=0;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
  })
  
  $("#nodecount").on("click", function() {
    if ($(this).prop("checked")) {
      $(".stat .stat-n").show()
      document.cookie = "nodecount=1;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
    else {
      $(".stat .stat-n").hide()
      document.cookie = "nodecount=0;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
  })

  $("#sortstats").on("click", function() {
    if ($(this).prop("checked")) {
      sortstats()
      document.cookie = "sortstats=1;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
    else {
      let table = $("table", activestats).first()
      table.children().sort((a, b) => $(a).attr("data-s").localeCompare($(b).attr("data-s"))).appendTo(table)
      table = $("table", activestats).last()
      table.children().sort((a, b) => $(a).attr("data-s").localeCompare($(b).attr("data-s"))).appendTo(table)
      document.cookie = "sortstats=0;expires=Tue, 19 Jan 2038 03:14:07 UTC"
    }
  })
}

//---------------------------------------- Load Data
function loadData() {  
  //---------------------------------------- Skills
  skills = {
    trickster: [
      /* 0  */ [ 1, [], [ 1, 30, 55 ], "", { "体力": 0.05, "シールドを発動すると、ダメージ軽減率が上昇する。": 0.05, "[HM]短射程距離の敵を倒すたびに最大体力の20%回復し、シールドが12%上昇する。": null } ],
      
      /* 1  */ [ 0, [ 0, 2, 3 ], [ 2, 3 ], "武器巧者", { "武器ダメージ (短射程)": 0.15 } ],
      /* 2  */ [ 0, [ 1, 4 ], [ 1, 4 ], "弾幕", { "リロード時間": -0.2 } ],
      /* 3  */ [ 0, [ 1, 4 ], [ 1, 4 ], "精密な射撃術", { "アーマー貫通": 0.15 } ],
      /* 4  */ [ 0, [ 2, 3, 6, 7, 25 ], [ 2, 3, 5, 6, 7, 25 ], "死の到来", { "武器ダメージ": 0.08 } ],
      /* 5  */ [ 0, [ 4 ], [], "ショットガン名人", { "武器ダメージ (ショットガン)": 0.15, "ドロップ率 (ショットガン)": 0.12 } ],
      /* 6  */ [ 0, [ 4, 8 ], [ 4, 8 ], "均等", { "スキルクールダウン (移動属性)": 0.15 } ],
      /* 7  */ [ 0, [ 4, 8 ], [ 4, 8 ], "死の影", { "クリティカルダメージ": 0.2 } ],
      /* 8  */ [ 0, [ 6, 7, 28 ], [ 6, 7, 9, 10, 11, 28 ], "武器巧者", { "武器ダメージ (短射程)": 0.15 } ],
      /* 9  */ [ 0, [ 8 ], [], "破壊的な火力", { "策略属性のスキルを発動すると、武器ダメージが8秒間50%上昇する。": null } ],
      /* 10 */ [ 0, [ 8 ], [ 12 ], "特異点", { "スキルクールダウン (策略属性)": 0.15 } ],
      /* 11 */ [ 0, [ 8 ], [ 12 ], "精密な射撃術", { "アーマー貫通": 0.15 } ],
      /* 12 */ [ 0, [ 10, 11 ], [ 13, 14, 15 ], "予期せぬ終焉", { "武器ダメージ (背後からの攻撃)": 0.2 } ],
      /* 13 */ [ 0, [ 12 ], [], "力の芽生", { "攻撃属性であるスキルの効果終了時、武器ダメージが8秒間50%上昇する。": null } ],
      /* 14 */ [ 0, [ 12 ], [ 16 ], "死の到来", { "武器ダメージ": 0.08 } ],
      /* 15 */ [ 0, [ 12 ], [ 16 ], "武器巧者", { "武器ダメージ (短射程)": 0.15 } ],
      /* 16 */ [ 0, [ 14, 15 ], [ 17, 19 ], "死の到来", { "武器ダメージ": 0.08 } ],
      /* 17 */ [ 0, [ 16 ], [ 18 ], "均衡", { "スキルクールダウン (移動属性)": 0.15 } ],
      /* 18 */ [ 0, [ 17 ], [], "輸血", { "武器による体力吸収量": 0.05 } ],
      /* 19 */ [ 0, [ 16 ], [ 20, 21 ], "予期せぬ終焉", { "武器ダメージ (背後からの攻撃)": 0.2 } ],
      /* 20 */ [ 0, [ 19 ], [], "賞金稼ぎ", { "武器ダメージ (エリートに対し)": 0.15 } ],
      /* 21 */ [ 0, [ 19 ], [ 22, 23 ], "不思議な計算", { "マガジンサイズ": 0.5 } ],
      /* 22 */ [ 0, [ 21 ], [ 24 ], "アサルト上手", { "武器ダメージ (アサルト)": 0.12 } ],
      /* 23 */ [ 0, [ 21 ], [ 24 ], "ショットガン上手", { "武器ダメージ (ショットガン)": 0.12 } ],
      /* 24 */ [ 0, [ 22, 23 ], [], "慎重な予測", { "短射程距離の敵1体につき、武器ダメージが8%上昇する。": null } ],
      
      /* 25 */ [ 0, [ 4, 26 ], [ 4, 26 ], "武器巧者", { "武器ダメージ (短射程)": 0.15 } ],
      /* 26 */ [ 0, [ 25, 33 ], [ 25, 33, 27 ], "死の跳躍", { "移動属性のスキルを発動すると、アーマー貫通が10秒間15%上昇する。": null } ],
      /* 27 */ [ 0, [ 26 ], [], "生命の連鎖", { "[HM] 短射程距離で死亡した敵1体につき、体力が10%回復する。": 0.1 } ],
      /* 28 */ [ 0, [ 8, 36 ], [ 8, 29, 36 ], "アウトライダーの処刑人", { "移動属性のスキルを発動すると、武器ダメージが8秒間50%上昇する。": null } ],
      /* 29 */ [ 0, [ 28 ], [], "精密な射撃術", { "アーマー貫通": 0.15 } ],
      
      /* 30 */ [ 0, [ 0, 31, 32 ], [ 31, 32 ], "アノマリーの保護", { "体力": 0.1 } ],
      /* 31 */ [ 0, [ 30, 33 ], [ 30, 33 ], "免疫", { "耐性": 0.15 } ],
      /* 32 */ [ 0, [ 30, 33 ], [ 30, 33 ], "驚異的な抵抗力", { "ダメージ軽減 (エリートから)": -0.2 } ],
      /* 33 */ [ 0, [ 26, 31, 32, 34, 35, 50 ], [ 26, 31, 32, 34, 35, 50 ], "アノマリーの保護", { "体力": 0.1 } ],
      /* 34 */ [ 0, [ 33, 36 ], [ 33, 36 ], "シールド展開の改善", { "シールド消耗率": -0.3 } ],
      /* 35 */ [ 0, [ 33, 36 ], [ 33, 36 ], "萎縮", { "弱体化効果の持続時間": 0.3 } ],
      /* 36 */ [ 0, [ 28, 34, 35, 53 ], [ 28, 34, 35, 37, 38, 53 ], "アノマリーの保護", { "体力": 0.1 } ],
      /* 37 */ [ 0, [ 36 ], [ 39 ], "免疫", { "耐性": 0.15 } ],
      /* 38 */ [ 0, [ 36 ], [ 39 ], "シールド展開の改善", { "シールド消耗率": -0.3 } ],
      /* 39 */ [ 0, [ 37, 38 ], [ 40, 41, 42 ], "特異点", { "スキルクールダウン (策略属性)": 0.15 } ],
      /* 40 */ [ 0, [ 39 ], [], "痛みの抑制", { "攻撃属性であるスキルの効果終了時、ダメージ軽減率が10秒間10%上昇する。": null } ],
      /* 41 */ [ 0, [ 39 ], [ 43 ], "アノマリーの外套", { "アーマー": 0.2 } ],
      /* 42 */ [ 0, [ 39 ], [ 43 ], "シールド増強", { "シールド獲得量": 0.1 } ],
      /* 43 */ [ 0, [ 41, 42 ], [ 44, 45 ], "シールド展開の改善", { "シールド消耗率": -0.3 } ],
      /* 44 */ [ 0, [ 43 ], [], "四面楚歌", { "単射程距離の敵1体につき、アーマーが15%上昇する。": null } ],
      /* 45 */ [ 0, [ 43 ], [ 46 ], "アノマリーの保護", { "体力": 0.1 } ],
      /* 46 */ [ 0, [ 45 ], [ 47, 48 ], "一挙両得", { "弾薬を回収するたび、最大体力の5%回復する。": null } ],
      /* 47 */ [ 0, [ 46 ], [ 49 ], "ダブルシールド", { "シールドが発動している間、ダメージ軽減率が6%上昇する。": 0.06 } ],
      /* 48 */ [ 0, [ 46 ], [ 49 ], "アノマリーの外套", { "アーマー": 0.2 } ],
      /* 49 */ [ 0, [ 47, 48 ], [], "シールド生成", { "策略属性のスキルを発動するたび、20%のシールドが付与される。": null } ],
      
      /* 50 */ [ 0, [ 33, 52 ], [ 33, 51, 52 ], "形勢逆転", { "敵に包囲された際、武器をリロードするとダメージを与え、その敵のアビリティを妨害する。ダメージはアノマリーパワーに応じて変わる。": null } ],
      /* 51 */ [ 0, [ 50 ], [], "生命の連鎖", { "[HM] 短射程距離で死亡した敵1体につき、体力が10%回復する。": 0.1 } ],
      /* 52 */ [ 0, [ 50, 58 ], [ 50, 58 ], "アノマリーの斬撃", { "クラス固有の近接攻撃スキルを発動すると、5秒間アノマリーパワーが30%上昇する。": null } ],
      /* 53 */ [ 0, [ 36, 62 ], [ 36, 54, 62 ], "弱体化の斬撃", { "クラス固有の近接攻撃スキルによる攻撃時、命中した敵に弱体化効果を付与する。": null } ],
      /* 54 */ [ 0, [ 53 ], [], "シールド増強", { "シールド獲得量": 0.1 } ],
      
      /* 55 */ [ 0, [ 0, 56, 57 ], [ 56, 57 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 56 */ [ 0, [ 55, 58 ], [ 55, 58 ], "生命力転送", { "スキルによる体力吸収量": 0.06 } ],
      /* 57 */ [ 0, [ 55, 58 ], [ 55, 58 ], "Disturbance Coating", { "耐性貫通": 0.1 } ],
      /* 58 */ [ 0, [ 52, 56, 57, 60, 61 ], [ 52, 56, 57, 59, 60, 61 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 59 */ [ 0, [ 58 ], [], "アサルト名人", { "アンロック済みの「集中」ノード1つにつき、アサルト武器によるダメージが7%上昇する。": null, "ドロップ率 (アサルト)": 0.12 } ],
      /* 60 */ [ 0, [ 58, 62 ], [ 58, 62 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 61 */ [ 0, [ 58, 62 ], [ 58, 62 ], "連撃", { "スキルクールダウン (ダメージ)": 0.15 } ],
      /* 62 */ [ 0, [ 53, 60, 61 ], [ 53, 60, 61, 63, 64, 65 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 63 */ [ 0, [ 62 ], [], "カウンターシールド", { "策略属性のスキルを発動すると、アノマリーパワーが10秒間50%上昇する。": null } ],
      /* 64 */ [ 0, [ 62 ], [ 66 ], "萎縮", { "弱体化効果の持続時間": 0.3 } ],
      /* 65 */ [ 0, [ 62 ], [ 66 ], "混乱の弾丸", { "耐性貫通": 0.1 } ],
      /* 66 */ [ 0, [ 64, 65 ], [ 67, 68, 69 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 67 */ [ 0, [ 66 ], [], "攻撃用シールドの展開", { "移動属性のスキルを発動すると、アノマリーパワーが10秒間50%上昇する。": null } ],
      /* 68 */ [ 0, [ 66 ], [ 70 ], "生命力転送", { "スキルによる体力吸収量": 0.06 } ],
      /* 69 */ [ 0, [ 66 ], [ 70 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 70 */ [ 0, [ 68, 69 ], [ 71, 73 ], "集中", { "アノマリーパワー": 0.06 } ],
      /* 71 */ [ 0, [ 70 ], [ 72 ], "連撃", { "スキルクールダウン (ダメージ)": 0.15 } ],
      /* 72 */ [ 0, [ 71 ], [], "アノマリーの加速", { "攻撃属性であるスキルの効果終了時、アノマリーパワーが10秒間50%上昇する。": null } ],
      /* 73 */ [ 0, [ 70 ], [ 74, 75 ], "生命力転送", { "スキルによる体力吸収量": 0.06 } ],
      /* 74 */ [ 0, [ 73 ], [], "とどめの一撃", { "移動属性のスキルを発動すると、耐性貫通が10秒間50%上昇する。": null } ],
      /* 75 */ [ 0, [ 73 ], [ 76, 77 ], "虚無の末裔", { "攻撃属性であるスキルの効果終了時に10秒間、アーマー貫通が30%、また耐性貫通が25%上昇する。": null } ],
      /* 76 */ [ 0, [ 75 ], [ 78 ], "影の抱擁", { "アノマリーパワーの15%分、火力が上昇する。": null } ],
      /* 77 */ [ 0, [ 75 ], [ 78 ], "シールド転化", { "[HM] 短距離射程で死亡した敵1体につき、体力の代わりにシールドが追加で20%上昇する。": null } ],
      /* 78 */ [ 0, [ 76, 77 ], [], "変異者の処刑人", { "短射程距離の敵1体につき、アノマリーパワーが10%上昇する。": null } ]
    ],
    
    pyromancer: [
       /* 0  */ [ 1, [], [ 1, 30, 56 ], "", { "アノマリーパワー": 0.1, "[HM] スキルを受けた敵を15秒間マークする。マークされた敵を倒すと最大体力の24%を回復する。": null } ],
      
       /* 1  */ [ 0, [ 0, 2, 3 ], [ 2, 3 ], "猛火の兵器", { "武器ダメージ": 0.08 } ],
       /* 2  */ [ 0, [ 1, 4 ], [ 1, 4 ], "群がる兵器", { "武器による体力吸収量": 0.05 } ],
       /* 3  */ [ 0, [ 1, 4 ], [ 1, 4 ], "基地への招待", { "スキルクールダウン (行動不能属性)": 0.15 } ],
       /* 4  */ [ 0, [ 2, 3, 6, 7, 25 ], [ 2, 3, 5, 6, 7, 25 ], "アノマリーの刻印", { "武器ダメージ (マークされた敵)": 0.1 } ],
       /* 5  */ [ 0, [ 4 ], [], "アサルト名人", { "武器ダメージ (アサルト)": 0.2, "ドロップ率 (アサルト)": 0.12 } ],
       /* 6  */ [ 0, [ 4, 8 ], [ 4, 8 ], "激昂", { "アーマー貫通": 0.15 } ],
       /* 7  */ [ 0, [ 4, 8 ], [ 4, 8 ], "灰の裁き", { "ダメージ (灰燼状態の敵)": 0.1 } ],
       /* 8  */ [ 0, [ 6, 7, 28 ], [ 6, 7, 9, 10, 11, 28 ], "アノマリーの刻印", { "武器ダメージ (マークされた敵)": 0.1 } ],
       /* 9  */ [ 0, [ 8 ], [], "激化", { "行動不能属性のスキルを発動すると、アノマリーパワーが10秒間45%上昇する。": null } ],
       /* 10 */ [ 0, [ 8 ], [ 12 ], "大火", { "耐性貫通": 0.15 } ],
       /* 11 */ [ 0, [ 8 ], [ 12 ], "火砕流", { "灰燼効果の持続時間": 0.15 } ],
       /* 12 */ [ 0, [ 10, 11 ], [ 13, 14, 15 ], "アノマリーの刻印", { "武器ダメージ (マークされた敵)": 0.1 } ],
       /* 13 */ [ 0, [ 12 ], [], "スナイパー名人", { "武器ダメージ (スナイパー)": 0.4, "ドロップ率 (スナイパー)": 0.12 } ],
       /* 14 */ [ 0, [ 12 ], [ 16 ], "激昂", { "アーマー貫通": 0.15 } ],
       /* 15 */ [ 0, [ 12 ], [ 16 ], "猛火の兵器", { "武器ダメージ": 0.08 } ],
       /* 16 */ [ 0, [ 14, 15 ], [ 17, 19, 20 ], "アノマリーの刻印", { "武器ダメージ (マークされた敵)": 0.1 } ],
       /* 17 */ [ 0, [ 16 ], [ 18 ], "群がる獲物", { "武器による体力吸収量": 0.05 } ],
       /* 18 */ [ 0, [ 17 ], [], "吸血", { "行動不能属性のスキルを発動すると、武器による体力吸収量が4秒間2倍になる。": null } ],
       /* 19 */ [ 0, [ 16 ], [], "更なる灰化", { "灰燼効果を的に与えるたびに、脆弱効果を付与する。": null } ],
       /* 20 */ [ 0, [ 16 ], [ 21 ], "高速着火", { "リロード時間": -0.2 } ],
       /* 21 */ [ 0, [ 20 ], [ 22, 23 ], "攻防一体", { "ダメージ (エリートに対し)": 0.1, "ダメージ軽減 (エリートから)": -0.1 } ],
       /* 22 */ [ 0, [ 21 ], [ 24 ], "灰の裁き", { "ダメージ (灰燼状態の敵)": 0.3 } ],
       /* 23 */ [ 0, [ 21 ], [ 24 ], "基地への招待", { "スキルクールダウン (行動不能属性)": 0.15 } ],
       /* 24 */ [ 0, [ 22, 23 ], [], "超激化", { "行動不能属性のスキルを発動すると、武器ダメージが10秒間60%上昇する。": null } ],
      
       /* 25 */ [ 0, [ 4, 26 ], [ 4, 26 ], "サイドアーム上手", { "武器ダメージ (サイドアーム)": 0.12 } ],
       /* 26 */ [ 0, [ 25, 33 ], [ 25, 33, 27 ], "装甲融解", { "アーマー貫通 (マークされた敵)": 0.3 } ],
       /* 27 */ [ 0, [ 26 ], [], "反動制御", { "射撃後の反動": -0.3 } ],
       /* 28 */ [ 0, [ 8, 36 ], [ 8, 29, 36 ], "焼却", { "炎上効果が切れた瞬間、その敵に灰燼効果が付与される。": null } ],
       /* 29 */ [ 0, [ 28 ], [], "火砕流", { "灰燼効果の持続時間": 0.15 } ],
      
       /* 30 */ [ 0, [ 0, 31, 32 ], [ 31, 32 ], "マグマゴレーム", { "体力": 0.1 } ],
       /* 31 */ [ 0, [ 30, 33 ], [ 30, 33 ], "抑えられぬ渇き", { "スキルによる体力吸収量": 0.06 } ],
       /* 32 */ [ 0, [ 30, 33 ], [ 30, 33 ], "適切な準備", { "スキルクールダウン (発火属性)": 0.15 } ],
       /* 33 */ [ 0, [ 26, 31, 32, 34, 35, 51 ], [ 26, 31, 32, 34, 35, 51 ], "マグマ・ゴーレム", { "体力": 0.1 } ],
       /* 34 */ [ 0, [ 33, 36 ], [ 33, 36 ], "アーマー取得", { "アーマー": 0.2 } ],
       /* 35 */ [ 0, [ 33, 36 ], [ 33, 36 ], "炉心溶解", { "炎上効果によって敵が受けるダメージ": 0.2 } ],
       /* 36 */ [ 0, [ 28, 34, 35, 54 ], [ 28, 34, 35, 37, 38, 54 ], "マグマ・ゴーレム", { "体力": 0.1 } ],
       /* 37 */ [ 0, [ 36 ], [ 39 ], "祝福", { "武器ダメージ": 0.05, "アノマリーパワー": 0.05 } ],
       /* 38 */ [ 0, [ 36 ], [ 39 ], "耐性取得", { "耐性": 0.2 } ],
       /* 39 */ [ 0, [ 37, 38 ], [ 40, 41, 42, 43 ], "マグマ・ゴーレム", { "体力": 0.1 } ],
       /* 40 */ [ 0, [ 39 ], [], "遥かなる炎", { "アンロック済みの「マグマ・ゴーレム」ノード1つにつき、アノマリーパワーが2.5%上昇する。": null } ],
       /* 41 */ [ 0, [ 39 ], [], "集中砲火", { "いずれかのスキルを発動すると、武器ダメージが7秒間20%上昇する。": null } ],
       /* 42 */ [ 0, [ 39 ], [ 44 ], "抑えられぬ渇き", { "スキルによる体力吸収量": 0.06 } ],
       /* 43 */ [ 0, [ 39 ], [ 44 ], "完全燃焼", { "炎上効果の持続時間": 0.2 } ],
       /* 44 */ [ 0, [ 42, 43 ], [ 45 ], "マグマ・ゴーレム", { "体力": 0.1 } ],
       /* 45 */ [ 0, [ 44 ], [ 46, 47 ], "抑えられぬ渇き", { "スキルによる体力吸収量": 0.06 } ],
       /* 46 */ [ 0, [ 45 ], [], "溶岩生成", { "発火属性のスキルを発動すると、アーマーが10秒間45%上昇する。": null } ],
       /* 47 */ [ 0, [ 45 ], [ 48, 49 ], "再燃する火種", { "体力が30%未満の時、スキルによる体力吸収が2倍になる。": null } ],
       /* 48 */ [ 0, [ 47 ], [ 50 ], "火の裁き", { "ダメージ (炎上状態の敵に対し)": 0.15 } ],
       /* 49 */ [ 0, [ 47 ], [ 50 ], "適切な準備", { "スキルクールダウン (発火属性)": 0.15 } ],
       /* 50 */ [ 0, [ 48, 49 ], [], "マグマ・エレメンタル", { "発火属性のスキルを発動すると、10秒間、アーマー貫通が45%、耐性貫通が45%上昇する。": null } ],
      
       /* 51 */ [ 0, [ 33, 53 ], [ 33, 52, 53 ], "野火", { "スキルクールダウン (爆発属性)": 0.1, "スキルクールダウン (炎上)": 0.1, "スキルクールダウン (行動不能属性)": 0.1 } ],
       /* 52 */ [ 0, [ 51 ], [], "炎の裁き", { "ダメージ (炎上状態の敵に対し)": 0.05 } ],
       /* 53 */ [ 0, [ 51, 59 ], [ 51, 59 ], "祝福", { "武器ダメージ": 0.05, "アノマリーパワー": 0.05 } ],
       /* 54 */ [ 0, [ 36, 63 ], [ 36, 55, 63 ], "根絶", { "体力が30%未満の敵に対するダメージが20%上昇する。": null } ],
       /* 55 */ [ 0, [ 54 ], [], "完全燃焼", { "炎上効果の持続時間": 0.2 } ],
      
       /* 56 */ [ 0, [ 0, 57, 58 ], [ 57, 58 ], "魔術師", { "アノマリーパワー": 0.06 } ],
       /* 57 */ [ 0, [ 56, 59 ], [ 56, 59 ], "重なる刻印", { "スキルダメージ (マークされた敵)": 0.1 } ],
       /* 58 */ [ 0, [ 56, 59 ], [ 56, 59 ], "焼き尽くす炎", { "スキルクールダウン (爆発属性)": 0.15 } ],
       /* 59 */ [ 0, [ 53, 57, 58, 61, 62 ], [ 53, 57, 58, 60, 61, 62 ], "魔術師", { "アノマリーパワー": 0.06 } ],
       /* 60 */ [ 0, [ 59 ], [], "火炎とライフル", { "爆発属性のスキルを発動すると、武器ダメージが10秒間45%上昇する。": null } ],
       /* 61 */ [ 0, [ 59, 63 ], [ 59, 63 ], "重なる刻印", { "スキルダメージ (マークされた敵)": 0.1 } ],
       /* 62 */ [ 0, [ 59, 63 ], [ 59, 63 ], "火炎の力", { "ダメージ軽減 (エリートから)": -0.1 } ],
       /* 63 */ [ 0, [ 54, 61, 62 ], [ 54, 61, 62, 64, 65, 66 ], "魔術師", { "アノマリーパワー": 0.06 } ],
       /* 64 */ [ 0, [ 63 ], [], "猛火の弾丸", { "アノマリーパワーの15%分、火力が上昇する。": null } ],
       /* 65 */ [ 0, [ 63 ], [ 67 ], "炉心溶解", { "炎上効果によって敵が受けるダメージ": 0.2 } ],
       /* 66 */ [ 0, [ 63 ], [ 67 ], "祝福", { "武器ダメージ": 0.05, "アノマリーパワー": 0.05 } ],
       /* 67 */ [ 0, [ 65, 66 ], [ 68, 69, 70 ], "魔術師", { "アノマリーパワー": 0.06 } ],
       /* 68 */ [ 0, [ 67 ], [], "火炎とアノマリー", { "爆発属性のスキルを発動すると、アノマリーパワーが10秒間上昇する。": null } ],
       /* 69 */ [ 0, [ 67 ], [ 71 ], "抑えられぬ渇き", { "スキルによる体力吸収量": 0.06 } ],
       /* 70 */ [ 0, [ 67 ], [ 71 ], "耐性性", { "耐性": 0.2 } ],
       /* 71 */ [ 0, [ 69, 70 ], [ 72, 74 ], "魔術師", { "アノマリーパワー": 0.06 } ],
       /* 72 */ [ 0, [ 71 ], [ 73 ], "不死鳥の雛鳥", { "[不死鳥] 体力がゼロになった際、体力が50%の状態で再度戦場へ復帰することができる。（180秒ごと）": null } ],
       /* 73 */ [ 0, [ 72 ], [], "不死鳥", { "[不死鳥] 不死鳥によって、体力が100%の状態で復帰できる。 (135秒ごと)": null } ],
       /* 74 */ [ 0, [ 71 ], [ 75, 76 ], "大火", { "耐性貫通": 0.15 } ],
       /* 75 */ [ 0, [ 74 ], [], "脅威の排除", { "[HM] マークされた敵を倒すと、追加で最大体力の12%回復する。": null } ],
       /* 76 */ [ 0, [ 74 ], [ 77, 78 ], "燃え立つ業火", { "ダメージ (エリートに対し)": 0.1 } ],
       /* 77 */ [ 0, [ 76 ], [ 79 ], "重なる刻印", { "スキルダメージ (マークされた敵)": 0.1 } ],
       /* 78 */ [ 0, [ 76 ], [ 79 ], "焼き尽くす炎", { "スキルクールダウン (爆発属性)": 0.15 } ],
       /* 79 */ [ 0, [ 77, 78 ], [], "燃え盛る死地", { "スキルダメージ (爆発属性)": 0.3 } ]
    ],
    
    devastator: [
       /* 0  */ [ 1, [], [ 1, 30, 55 ], "", { "[HM] 短射程距離の敵を倒すたびに最大体力の24%回復する。": null, "体力": 0.15, "アーマー": 0.3 } ],
      
       /* 1  */ [ 0, [ 0, 2, 3 ], [ 2, 3 ], "粉砕", { "武器ダメージ": 0.08 } ],
       /* 2  */ [ 0, [ 1, 4 ], [ 1, 4 ], "ショットガン上手", { "武器ダメージ (ショットガン)": 0.12 } ],
       /* 3  */ [ 0, [ 1, 4 ], [ 1, 4 ], "装甲破壊", { "アーマー貫通": 0.15 } ],
       /* 4  */ [ 0, [ 2, 3, 6, 7, 25 ], [ 2, 3, 5, 6, 7, 25 ], "荒くれ者", { "武器ダメージ (短射程)": 0.15 } ],
       /* 5  */ [ 0, [ 4 ], [], "ショットガン名人", { "武器ダメージ (ショットガン)": 0.15, "ドロップ率 (ショットガン)": 0.12 } ],
       /* 6  */ [ 0, [ 4, 8 ], [ 4, 8 ], "アサルト上手", { "武器ダメージ (アサルト)": 0.12 } ],
       /* 7  */ [ 0, [ 4, 8 ], [ 4, 8 ], "装甲破壊", { "アーマー貫通": 0.15 } ],
       /* 8  */ [ 0, [ 6, 7, 28 ], [ 6, 7, 9, 10, 11, 28 ], "粉砕", { "武器ダメージ": 0.08 } ],
       /* 9  */ [ 0, [ 8 ], [], "闘士", { "防衛属性のスキルを発動すると、武器ダメージが10秒間45%上昇する。": null } ],
       /* 10 */ [ 0, [ 8 ], [ 12 ], "会心", { "クリティカルダメージ": 0.2 } ],
       /* 11 */ [ 0, [ 8 ], [ 12 ], "安定感", { "射撃後の反動": -0.3 } ],
       /* 12 */ [ 0, [ 10, 11 ], [ 13, 14, 15 ], "粉砕", { "武器ダメージ": 0.08 } ],
       /* 13 */ [ 0, [ 12 ], [], "アサルト名人", { "武器ダメージ (アサルト)": 0.2, "ドロップ率 (アサルト)": 0.12 } ],
       /* 14 */ [ 0, [ 12 ], [ 16 ], "永久運動", { "スキルクールダウン (起動属性)": 0.15 } ],
       /* 15 */ [ 0, [ 12 ], [ 16 ], "荒くれ者", { "武器ダメージ (短射程)": 0.15 } ],
       /* 16 */ [ 0, [ 14, 15 ], [ 17, 19 ], "粉砕", { "武器ダメージ": 0.08 } ],
       /* 17 */ [ 0, [ 16 ], [ 18 ], "完全なる吸収", { "武器による体力吸収量": 0.05 } ],
       /* 18 */ [ 0, [ 17 ], [], "賞金稼ぎ", { "ダメージ (エリートに対し)": 0.15, "ダメージ軽減  (エリートから)": -0.15 } ],
       /* 19 */ [ 0, [ 16 ], [ 20, 21 ], "弾幕", { "リロード時間": -0.2 } ],
       /* 20 */ [ 0, [ 19 ], [], "弾薬備蓄", { "マガジンサイズ": 0.5 } ],
       /* 21 */ [ 0, [ 19 ], [ 22, 23 ], "対峙", { "敵から攻撃を受けると、その敵の物理ダメージが5秒間10%低下する。自分がその敵にダメージを与えた場合は、効果が倍になる。": null } ],
       /* 22 */ [ 0, [ 21 ], [ 24 ], "完全なる吸収", { "武器による体力吸収量": 0.05 } ],
       /* 23 */ [ 0, [ 21 ], [ 24 ], "装甲破壊", { "アーマー貫通": 0.15 } ],
       /* 24 */ [ 0, [ 22, 23 ], [], "変異者の突撃", { "起動属性であるスキルの効果終了時、武器ダメージが10秒間70%上昇する。": null } ],
      
       /* 25 */ [ 0, [ 4, 26 ], [ 4, 26 ], "永久運動", { "スキルクールダウン (起動属性)": 0.15 } ],
       /* 26 */ [ 0, [ 25, 33 ], [ 25, 33, 27 ], "突撃", { "起動属性であるスキルの効果終了時、ダメージ軽減率が10秒間15%上昇する。": null } ],
       /* 27 */ [ 0, [ 26 ], [], "活力", { "アンロック済みのアノマリーの恩師ノード1つにつき、武器によるダメージが10%上昇する。": null } ],
       /* 28 */ [ 0, [ 8, 36 ], [ 8, 29, 36 ], "装甲継承", { "短射程距離にいる敵が死亡すると、その敵のアーマーの20%が10秒間自分に反映される。": null } ],
       /* 29 */ [ 0, [ 28 ], [], "一挙両得", { "弾薬を入手すると、体力が5%回復する。": null } ],
      
       /* 30 */ [ 0, [ 0, 31, 32 ], [ 31, 32 ], "巨像", { "体力": 0.1 } ],
       /* 31 */ [ 0, [ 30, 33 ], [ 30, 33 ], "鉄壁", { "アーマー": 0.2 } ],
       /* 32 */ [ 0, [ 30, 33 ], [ 30, 33 ], "アノマリーの恩師", { "毎秒体力が回復する": 0.01 } ],
       /* 33 */ [ 0, [ 26, 31, 32, 34, 35, 50 ], [ 26, 31, 32, 34, 35, 50 ], "巨像", { "体力": 0.1 } ],
       /* 34 */ [ 0, [ 33, 36 ], [ 33, 36 ], "模倣的な抗戦", { "耐性": 0.2 } ],
       /* 35 */ [ 0, [ 33, 36 ], [ 33, 36 ], "アノマリーの恩師", { "毎秒体力が回復する": 0.01 } ],
       /* 36 */ [ 0, [ 28, 34, 35, 53 ], [ 28, 34, 35, 37, 38, 53 ], "巨像", { "体力": 0.1 } ],
       /* 37 */ [ 0, [ 36 ], [ 39 ], "アノマリーの恩師", { "毎秒体力が回復する": 0.01 } ],
       /* 38 */ [ 0, [ 36 ], [ 39 ], "鉄壁", { "アーマー": 0.2 } ],
       /* 39 */ [ 0, [ 37, 38 ], [ 40, 41, 42 ], "巨像", { "体力": 0.1 } ],
       /* 40 */ [ 0, [ 39 ], [], "アウトライダーの指揮官", { "自分と味方の体力回復量が20%上昇し、シールド値が20%上昇する。": null } ],
       /* 41 */ [ 0, [ 39 ], [ 43 ], "巨像", { "体力": 0.1 } ],
       /* 42 */ [ 0, [ 39 ], [ 43 ], "不屈の番兵", { "スキルクールダウン (防衛属性)": 0.15 } ],
       /* 43 */ [ 0, [ 41, 42 ], [ 44, 45 ], "抗戦", { "短射程距離の敵1体につき、耐性が15%上昇する。": null } ],
       /* 44 */ [ 0, [ 43 ], [], "破れぬ誓い", { "100%の確率で致死ダメージを無視し、体力を50%回復する。この効果は180秒ごとに発動可能。": null } ],
       /* 45 */ [ 0, [ 43 ], [ 46 ], "鉄壁", { "アーマー": 0.2 } ],
       /* 46 */ [ 0, [ 45 ], [ 47, 48 ], "戦場の覇者", { "[HM] 短射程距離で死亡した敵1体につき、体力が10%回復する。": null } ],
       /* 47 */ [ 0, [ 46 ], [ 49 ], "模倣的な抗戦", { "耐性": 0.2 } ],
       /* 48 */ [ 0, [ 46 ], [ 49 ], "鉄壁", { "アーマー": 0.2  } ],
       /* 49 */ [ 0, [ 47, 48 ], [], "偉大なる防壁", { "自身のアーマー値の10%分、火力が上昇する。": null, "自身のアーマー値の10%分、アノマリーパワーが上昇する。": null } ],
      
       /* 50 */ [ 0, [ 33, 52 ], [ 33, 51, 52 ], "アノマリーの制裁", { "クラス固有の近接攻撃スキルを発動すると、耐性貫通が10秒間、攻撃が命中した敵1体につき15%上昇する。": null } ],
       /* 51 */ [ 0, [ 50 ], [], "巨像", { "体力": 0.1 } ],
       /* 52 */ [ 0, [ 50, 58 ], [ 50, 58 ], "Unending Watch", { "スキルクールダウン (防衛属性)": 0.15 } ],
       /* 53 */ [ 0, [ 36, 62 ], [ 36, 54, 62 ], "着実な照準", { "短射程と見なされる距離が4メートル長くなる。": null } ],
       /* 54 */ [ 0, [ 53 ], [], "敵陣突破", { "短射程距離の敵1体につき、アーマーが7%上昇する。": null } ],
      
       /* 55 */ [ 0, [ 0, 56, 57 ], [ 56, 57 ], "アノマリーの源流", { "アノマリーパワー": 0.06 } ],
       /* 56 */ [ 0, [ 55, 58 ], [ 55, 58 ], "振動継続", { "スキルクールダウン (地震属性)": 0.15 } ],
       /* 57 */ [ 0, [ 55, 58 ], [ 55, 58 ], "再生", { "スキルによる体力吸収量": 0.06 } ],
       /* 58 */ [ 0, [ 52, 56, 57, 60, 61 ], [ 52, 56, 57, 59, 60, 61 ], "アノマリーの源流", { "アノマリーパワー": 0.06 } ],
       /* 59 */ [ 0, [ 58 ], [], "騎士", { "防衛属性のスキルを発動すると、アノマリーパワーが10秒間45%上昇する。": null } ],
       /* 60 */ [ 0, [ 58, 62 ], [ 58, 62 ], "アノマリーの結晶", { "耐性貫通": 0.15 } ],
       /* 61 */ [ 0, [ 58, 62 ], [ 58, 62 ], "永久運動", { "スキルクールダウン (起動属性)": 0.15 } ],
       /* 62 */ [ 0, [ 53, 60, 61 ], [ 53, 60, 61, 63, 64, 65 ], "アノマリーの源流", { "アノマリーパワー": 0.06 } ],
       /* 63 */ [ 0, [ 62 ], [], "アノマリーの弾薬", { "アノマリーパワーの15%分、火力が上昇する。": null } ],
       /* 64 */ [ 0, [ 62 ], [ 66 ], "赤き川", { "出血効果の持続時間": 0.3 } ],
       /* 65 */ [ 0, [ 62 ], [ 66 ], "振動継続", { "スキルクールダウン (地震属性)": 0.15 } ],
       /* 66 */ [ 0, [ 64, 65 ], [ 67, 68, 69 ], "アノマリーの源流", { "アノマリーパワー": 0.06 } ],
       /* 67 */ [ 0, [ 66 ], [], "鉄拳制裁", { "クラス固有の近接攻撃スキルのダメージが2倍になる。": null } ],
       /* 68 */ [ 0, [ 66 ], [ 70 ], "処刑人", { "体力が30%未満の敵に対するダメージが20%上昇する。": null } ],
       /* 69 */ [ 0, [ 66 ], [ 70 ], "赤き川", { "出血効果の持続時間": 0.3 } ],
       /* 70 */ [ 0, [ 68, 69 ], [ 71, 73 ], "アノマリーの源流", { "アノマリーパワー": 0.06 } ],
       /* 71 */ [ 0, [ 70 ], [ 72 ], "血の海", { "出血効果の敵に対し": 0.3 } ],
       /* 72 */ [ 0, [ 71 ], [], "血の恩寵", { "出血ダメージの35%、体力を回復する。": null } ],
       /* 73 */ [ 0, [ 70 ], [ 74, 75 ], "再生", { "スキルによる体力吸収量": 0.06 } ],
       /* 74 */ [ 0, [ 73 ], [], "アノマリーの加護", { "アーマーボーナスがアノマリーパワーの40%上昇する。": null } ],
       /* 75 */ [ 0, [ 73 ], [ 76, 77 ], "熟練の哨兵", { "スキルの効果終了時、10秒間、アーマーが20%、耐性が20%上昇する。": null } ],
       /* 76 */ [ 0, [ 75 ], [ 78 ], "アノマリーの結晶", { "耐性貫通": 0.15 } ],
       /* 77 */ [ 0, [ 75 ], [ 78 ], "血の海", { "出血効果の敵に対し": 0.3 } ],
       /* 78 */ [ 0, [ 76, 77 ], [], "地球の遺産", { "スキルダメージ (地震属性)": 0.5 } ]
    ],
    
    technomancer: [
       /* 0  */ [ 1, [], [ 1, 29, 55 ], "", { "武器ダメージ (長射程)": 0.15, "スキルによる体力吸収量": 0.15, "武器による体力吸収量": 0.15 } ],
      
       /* 1  */ [ 0, [ 0, 2, 3 ], [ 2, 3 ], "衝撃増幅器", { "武器ダメージ": 0.08 } ],
       /* 2  */ [ 0, [ 1, 4 ], [ 1, 4 ], "吸引装置", { "武器による体力吸収量": 0.05 } ],
       /* 3  */ [ 0, [ 1, 4 ], [ 1, 4 ], "腐敗促進", { "スキルクールダウン (腐敗属性)": 0.15 } ],
       /* 4  */ [ 0, [ 2, 3, 6, 7, 24 ], [ 2, 3, 5, 6, 7, 24 ], "貫通の弾薬", { "アーマー貫通": 0.15 } ],
       /* 5  */ [ 0, [ 4 ], [], "スナイパー名人", { "武器ダメージ (スナイパー)": 0.4, "ドロップ率 (スナイパー)": 0.12 } ],
       /* 6  */ [ 0, [ 4, 8 ], [ 4, 8 ], "窒素カプセル", { "長射程と見なされる距離が3メートル近くなる[1]": null } ],
       /* 7  */ [ 0, [ 4, 8 ], [ 4, 8 ], "毒物学者", { "毒効果の持続時間": 0.3 } ],
       /* 8  */ [ 0, [ 6, 7, 27 ], [ 6, 7, 9, 10, 11, 27 ], "衝撃増幅器", { "武器ダメージ": 0.08 } ],
       /* 9  */ [ 0, [ 8 ], [], "連続砲撃", { "兵器属性のスキルを発動すると、自分と味方の武器によるダメージが10秒間30%上昇する。": null } ],
       /* 10 */ [ 0, [ 8 ], [ 12 ], "窒素カプセル", { "長射程と見なされる距離が3メートル近くなる[2]": null } ],
       /* 11 */ [ 0, [ 8 ], [ 12 ], "粛清", { "ダメージ (毒状態の敵に対し)": 0.1 } ],
       /* 12 */ [ 0, [ 10, 11 ], [ 13, 14, 15 ], "衝撃増幅器", { "武器ダメージ": 0.08 } ],
       /* 13 */ [ 0, [ 12 ], [], "アサルト名人", { "武器ダメージ (アサルト)": 0.2, "ドロップ率 (アサルト)": 0.12 } ],
       /* 14 */ [ 0, [ 12 ], [ 16 ], "アサルト上手", { "武器ダメージ (アサルト)": 0.12 } ],
       /* 15 */ [ 0, [ 12 ], [ 16 ], "スナイパー上手", { "武器ダメージ (スナイパー)": 0.12 } ],
       /* 16 */ [ 0, [ 14, 15 ], [ 17, 18 ], "貫通の弾丸", { "アーマー貫通": 0.15 } ],
       /* 17 */ [ 0, [ 16 ], [], "諸刃の剣", { "全ての被ダメージ": 0.15, "ダメージ": 0.2 } ],
       /* 18 */ [ 0, [ 16 ], [ 19, 20 ], "射撃名人", { "武器ダメージ (長射程)": 0.3 } ],
       /* 19 */ [ 0, [ 18 ], [], "大増幅", { "アンロック済みの「衝撃増幅器」ノード１つにつき、アノマリーパワーが4%上昇する": null } ],
       /* 20 */ [ 0, [ 18 ], [ 21, 22 ], "UT-14クリップ", { "マガジンサイズ": 0.5 } ],
       /* 21 */ [ 0, [ 20 ], [ 23 ], "一撃必殺", { "リロード後、最初の1発の武器ダメージが200%上昇する (クールダウン5秒)": null } ],
       /* 22 */ [ 0, [ 20 ], [ 23 ], "粛清", { "ダメージ (毒状態の敵に対し)": 0.3 } ],
       /* 23 */ [ 0, [ 21, 22 ], [], "身体強化装置", { "腐敗属性のスキルを発動すると、自分と味方の武器ダメージが10秒間40%上昇する。": null } ],
      
       /* 24 */ [ 0, [ 4, 25 ], [ 4, 25 ], "BL-STM攻撃システム", { "クリティカルダメージ": 0.15 } ],
       /* 25 */ [ 0, [ 24, 32 ], [ 24, 32, 26 ], "毒撃", { "毒効果を与えるたびに、脆弱効果を付与する。": null } ],
       /* 26 */ [ 0, [ 25 ], [], "処刑の標的", { "敵が受ける脆弱効果": 0.4 } ],
       /* 27 */ [ 0, [ 8, 35 ], [ 8, 28, 35 ], "煙幕", { "体力回復量の上限が最大体力の20%分上昇する。": null } ],
       /* 28 */ [ 0, [ 27 ], [], "技術者", { "タレットの耐性力減少率": -0.3 } ],
      
       /* 29 */ [ 0, [ 0, 30, 31 ], [ 30, 31 ], "特異体質", { "体力": 0.1 } ],
       /* 30 */ [ 0, [ 29, 32 ], [ 29, 32 ], "A.N.E.T.A.プレート", { "耐性": 0.2 } ],
       /* 31 */ [ 0, [ 29, 32 ], [ 29, 32 ], "発明家", { "スキルクールダウン (装置属性)": 0.15 } ],
       /* 32 */ [ 0, [ 25, 30, 31, 33, 34, 51 ], [ 25, 30, 31, 33, 34, 51 ], "特異体質", { "体力": 0.1 } ],
       /* 33 */ [ 0, [ 32, 35 ], [ 32, 35 ], "装甲", { "アーマー": 0.2 } ],
       /* 34 */ [ 0, [ 32, 35 ], [ 32, 35 ], "破砕", { "ダメージ (氷結状態の敵に対し)": 0.1 } ],
       /* 35 */ [ 0, [ 27, 33, 34, 54 ], [ 27, 33, 34, 36, 37, 54 ], "特異体質", { "体力": 0.1 } ],
       /* 36 */ [ 0, [ 35 ], [ 38 ], "生命力誘引", { "スキルによる体力吸収量": 0.06 } ],
       /* 37 */ [ 0, [ 35 ], [ 38 ], "発明家", { "スキルクールダウン (装置属性)": 0.15 } ],
       /* 38 */ [ 0, [ 36, 37 ], [ 39, 40, 42, 43 ], "特異体質", { "体力": 0.1 } ],
       /* 39 */ [ 0, [ 38 ], [], "熟練技術者", { "タレットのスキル耐久力が100%上昇する。": null } ],
       /* 40 */ [ 0, [ 38 ], [ 41 ], "氷撃", { "氷結効果を与えるたびに、脆弱効果を付与する。": null } ],
       /* 41 */ [ 0, [ 40 ], [], "処刑の標的", { "敵が受ける脆弱効果": 0.4 } ],
       /* 42 */ [ 0, [ 38 ], [ 44 ], "装甲", { "アーマー": 0.2 } ],
       /* 43 */ [ 0, [ 38 ], [ 44 ], "Sols-56 冷凍タンク", { "氷結効果の持続時間": 0.2 } ],
       /* 44 */ [ 0, [ 42, 43 ], [ 45 ], "吸引装置", { "武器による体力吸収量": 0.05 } ],
       /* 45 */ [ 0, [ 44 ], [ 46, 47 ], "装甲", { "アーマー": 0.2 } ],
       /* 46 */ [ 0, [ 45 ], [], "医療の達人", { "装置属性のスキルを発動すると、自分と味方の体力回復量が7秒間30%上昇する。": null } ],
       /* 47 */ [ 0, [ 45 ], [ 48, 49 ], "医学士", { "自分と味方の体力回復量が20%上昇する。": null } ],
       /* 48 */ [ 0, [ 47 ], [ 50 ], "生命力誘引", { "スキルによる体力吸収量": 0.06 } ],
       /* 49 */ [ 0, [ 47 ], [ 50 ], "破砕", { "ダメージ (氷結状態の敵に対し)": 0.3 } ],
       /* 50 */ [ 0, [ 48, 49 ], [], "限界突破", { "装置属性のスキルを発動すると、アノマリーパワーと武器ダメージが10秒間40%上昇する。": null, "体力がゼロになってから10秒間の間、180秒ごとに50%の体力で復活できるチャンスが得られる。": null } ],
       
       /* 51 */ [ 0, [ 32, 53 ], [ 32, 52, 53 ], "冬の防壁", { "クラス固有の近接攻撃アビリティを発動すると、ダメージ軽減率が3秒間40%上昇する。": null } ],
       /* 52 */ [ 0, [ 51 ], [], "Sols-56冷凍タンク", { "氷結効果の持続時間": 0.2 } ],
       /* 53 */ [ 0, [ 51, 58 ], [ 51, 58 ], "サイドアーム上手", { "武器ダメージ (サイドアーム)": 0.12 } ],
       /* 54 */ [ 0, [ 35, 62 ], [ 35, 62 ], "滅殺", { "体力が30%未満の敵に対するダメージが20%上昇する。": null } ],
      
       /* 55 */ [ 0, [ 0, 56, 57 ], [ 56, 57 ], "アノマリーの充填", { "アノマリーパワー": 0.06 } ],
       /* 56 */ [ 0, [ 55, 58 ], [ 55, 58 ], "兵器技術士", { "スキルクールダウン (兵器属性)": 0.15 } ],
       /* 57 */ [ 0, [ 55, 58 ], [ 55, 58 ], "混乱の弾薬", { "耐性貫通": 0.15 } ],
       /* 58 */ [ 0, [ 53, 56, 57, 60, 61 ], [ 53, 56, 57, 59, 60, 61 ], "アノマリーパワー", { "アノマリーパワー": 0.06 } ],
       /* 59 */ [ 0, [ 58 ], [], "急速冷凍", { "クラス固有の近接攻撃スキルによる攻撃時、命中した敵を毒状態にする。": null } ],
       /* 60 */ [ 0, [ 58, 62 ], [ 58, 62 ], "A.N.E.T.A.プレート", { "耐性": 0.2 } ],
       /* 61 */ [ 0, [ 58, 62 ], [ 58, 62 ], "手洗い歓迎", { "リロード後、最初の1発の火力がアノマリーパワーの15%上昇する。": null } ],
       /* 62 */ [ 0, [ 54, 60, 61 ], [ 54, 60, 61, 63, 64, 65 ], "アノマリーパワー", { "アノマリーパワー": 0.06 } ],
       /* 63 */ [ 0, [ 62 ], [], "身体覚醒装置", { "腐敗属性のスキルを発動すると、自分と味方のアノマリーパワーが10秒間30%上昇する。": null } ],
       /* 64 */ [ 0, [ 62 ], [ 66 ], "兵士技術士", { "スキルクールダウン (兵器属性)": 0.15 } ],
       /* 65 */ [ 0, [ 62 ], [ 66 ], "毒物学者", { "毒効果の持続時間": 0.3 } ],
       /* 66 */ [ 0, [ 64, 65 ], [ 67, 68, 69 ], "アノマリーパワー", { "アノマリーパワー": 0.06 } ],
       /* 67 */ [ 0, [ 66 ], [], "超吸収", { "兵器属性のスキルを発動すると、スキルによる体力吸収量が7秒間15%上昇する。": null } ],
       /* 68 */ [ 0, [ 66 ], [ 70 ], "アノマリーの充填", { "アノマリーパワー": 0.06 } ],
       /* 69 */ [ 0, [ 66 ], [ 70 ], "D-Kay毒素", { "毒ダメージ": 0.2 } ],
       /* 70 */ [ 0, [ 68, 69 ], [ 71, 73 ], "混乱の弾薬", { "耐性貫通": 0.15 } ],
       /* 71 */ [ 0, [ 70 ], [ 72 ], "生命力誘引", { "スキルによる体力吸収量": 0.06 } ],
       /* 72 */ [ 0, [ 71 ], [], "装甲強化", { "兵器属性のスキルを発動すると、アーマーが15秒間50%上昇する。": null } ],
       /* 73 */ [ 0, [ 70 ], [ 74, 75 ], "アノマリーの充填", { "アノマリーパワー": 0.06 } ],
       /* 74 */ [ 0, [ 73 ], [], "チームプレイヤー", { "自分と味方がエリートから受けるダメージが10%低下する。": null } ],
       /* 75 */ [ 0, [ 73 ], [ 76, 77 ], "緊急輸血", { "体力が30%未満の時、スキルによる体力吸収量が2倍になる。": null } ],
       /* 76 */ [ 0, [ 75 ], [ 78 ], "アノマリーの充填", { "アノマリーパワー": 0.06 } ],
       /* 77 */ [ 0, [ 75 ], [ 78 ], "D-Kay毒素", { "毒ダメージ": 0.2 } ],
       /* 78 */ [ 0, [ 76, 77 ], [], "技術者の結束", { "兵器属性のスキルを発動すると、アノマリーパワーが10秒間50%上昇する。 ": null } ]
    ]
  }
  
  //----------------------------------------- Node Positions
  let allcoords = {
    trickster: [
      [ 108, 375, 2 ],
      
      [ 252, 329, 0 ],
      [ 347, 186, 0 ],
      [ 394, 281, 0 ],
      [ 490, 138, 0 ],
      [ 480, 33, 1 ],
      [ 632, 91, 0 ],
      [ 632, 186, 0 ],
      [ 727, 138, 0 ],
      [ 717, 33, 1 ],
      [ 822, 91, 0 ],
      [ 822, 186, 0 ],
      [ 918, 138, 0 ],
      [ 908, 33, 1 ],
      [ 1013, 91, 0 ],
      [ 1013, 186, 0 ],
      [ 1108, 138, 0 ],
      [ 1108, 43, 0 ],
      [ 1193, 33, 1 ],
      [ 1203, 138, 0 ],
      [ 1193, 224, 1 ],
      [ 1288, 176, 1 ],
      [ 1393, 138, 0 ],
      [ 1393, 234, 0 ],
      [ 1478, 176, 1 ],
      
      [ 490, 234, 0 ],
      [ 480, 319, 1 ],
      [ 585, 281, 0 ],
      [ 717, 271, 1 ],
      [ 822, 281, 0 ],
      
      [ 299, 424, 0 ],
      [ 394, 376, 0 ],
      [ 394, 471, 0 ],
      [ 490, 424, 0 ],
      [ 632, 376, 0 ],
      [ 632, 471, 0 ],
      [ 727, 424, 0 ],
      [ 822, 376, 0 ],
      [ 822, 471, 0 ],
      [ 918, 424, 0 ],
      [ 908, 509, 1 ],
      [ 1013, 376, 0 ],
      [ 1013, 471, 0 ],
      [ 1108, 424, 0 ],
      [ 1098, 319, 1 ],
      [ 1203, 424, 0 ],
      [ 1288, 414, 1 ],
      [ 1393, 376, 0 ],
      [ 1393, 471, 0 ],
      [ 1478, 414, 1 ],
      
      [ 480, 509, 1 ],
      [ 585, 566, 0 ],
      [ 490, 614, 0 ],
      [ 717, 556, 1 ],
      [ 822, 566, 0 ],
      
      [ 252, 519, 0 ],
      [ 394, 566, 0 ],
      [ 347, 662, 0 ],
      [ 490, 709, 0 ],
      [ 480, 794, 1 ],
      [ 632, 662, 0 ],
      [ 632, 757, 0 ],
      [ 727, 709, 0 ],
      [ 717, 794, 1 ],
      [ 822, 662, 0 ],
      [ 822, 757, 0 ],
      [ 918, 709, 0 ],
      [ 908, 794, 1 ],
      [ 1013, 662, 0 ],
      [ 1013, 757, 0 ],
      [ 1108, 709, 0 ],
      [ 1108, 804, 0 ],
      [ 1192, 794, 1 ],
      [ 1202, 709, 0 ],
      [ 1192, 604, 1 ],
      [ 1288, 652, 1 ],
      [ 1393, 614, 0 ],
      [ 1393, 709, 0 ],
      [ 1478, 652, 1 ]
    ],
    
    pyromancer: [
      [ 108, 375, 2 ],
      
      [ 252, 329, 0 ],
      [ 347, 186, 0 ],
      [ 394, 281, 0 ],
      [ 490, 138, 0 ],
      [ 480, 33, 1 ],
      [ 632, 91, 0 ],
      [ 632, 186, 0 ],
      [ 727, 138, 0 ],
      [ 717, 33, 1 ],
      [ 822, 91, 0 ],
      [ 822, 186, 0 ],
      [ 918, 138, 0 ],
      [ 908, 33, 1 ],
      [ 1013, 91, 0 ],
      [ 1013, 186, 0 ],
      [ 1108, 138, 0 ],
      [ 1108, 43, 0 ],
      [ 1193, 33, 1 ],
      [ 1098, 224, 1 ],
      [ 1203, 186, 0 ],
      [ 1288, 176, 1 ],
      [ 1393, 138, 0 ],
      [ 1393, 234, 0 ],
      [ 1478, 176, 1 ],
      
      [ 490, 234, 0 ],
      [ 480, 319, 1 ],
      [ 585, 281, 0 ],
      [ 717, 271, 1 ],
      [ 822, 281, 0 ],
      
      [ 299, 424, 0 ],
      [ 394, 376, 0 ],
      [ 394, 471, 0 ],
      [ 490, 424, 0 ],
      [ 632, 376, 0 ],
      [ 632, 471, 0 ],
      [ 727, 424, 0 ],
      [ 822, 376, 0 ],
      [ 822, 471, 0 ],
      [ 918, 424, 0 ],
      [ 908, 319, 1 ],
      [ 908, 509, 1 ],
      [ 1013, 376, 0 ],
      [ 1013, 471, 0 ],
      [ 1108, 424, 0 ],
      [ 1203, 424, 0 ],
      [ 1193, 319, 1 ],
      [ 1288, 414, 1 ],
      [ 1393, 376, 0 ],
      [ 1393, 471, 0 ],
      [ 1478, 414, 1 ],
      
      [ 480, 509, 1 ],
      [ 585, 566, 0 ],
      [ 490, 614, 0 ],
      [ 717, 556, 1 ],
      [ 822, 566, 0 ],
      
      [ 252, 519, 0 ],
      [ 394, 566, 0 ],
      [ 347, 662, 0 ],
      [ 490, 709, 0 ],
      [ 480, 794, 1 ],
      [ 632, 662, 0 ],
      [ 632, 757, 0 ],
      [ 727, 709, 0 ],
      [ 717, 794, 1 ],
      [ 822, 662, 0 ],
      [ 822, 757, 0 ],
      [ 918, 709, 0 ],
      [ 908, 794, 1 ],
      [ 1013, 662, 0 ],
      [ 1013, 757, 0 ],
      [ 1108, 709, 0 ],
      [ 1098, 794, 1 ],
      [ 1202, 804, 0 ],
      [ 1202, 709, 0 ],
      [ 1192, 604, 1 ],
      [ 1288, 652, 1 ],
      [ 1393, 614, 0 ],
      [ 1393, 709, 0 ],
      [ 1478, 652, 1 ]
    ],
    
    devastator: [
      [ 108, 375, 2 ],
      
      [ 252, 329, 0 ],
      [ 347, 186, 0 ],
      [ 394, 281, 0 ],
      [ 490, 138, 0 ],
      [ 480, 33, 1 ],
      [ 632, 91, 0 ],
      [ 632, 186, 0 ],
      [ 727, 138, 0 ],
      [ 717, 33, 1 ],
      [ 822, 91, 0 ],
      [ 822, 186, 0 ],
      [ 918, 138, 0 ],
      [ 908, 33, 1 ],
      [ 1013, 91, 0 ],
      [ 1013, 186, 0 ],
      [ 1108, 138, 0 ],
      [ 1108, 43, 0 ],
      [ 1193, 33, 1 ],
      [ 1203, 138, 0 ],
      [ 1193, 224, 1 ],
      [ 1288, 176, 1 ],
      [ 1393, 138, 0 ],
      [ 1393, 234, 0 ],
      [ 1478, 176, 1 ],
      
      [ 490, 234, 0 ],
      [ 480, 319, 1 ],
      [ 585, 281, 0 ],
      [ 717, 271, 1 ],
      [ 822, 281, 0 ],
      
      [ 299, 424, 0 ],
      [ 394, 376, 0 ],
      [ 394, 471, 0 ],
      [ 490, 424, 0 ],
      [ 632, 376, 0 ],
      [ 632, 471, 0 ],
      [ 727, 424, 0 ],
      [ 822, 376, 0 ],
      [ 822, 471, 0 ],
      [ 918, 424, 0 ],
      [ 908, 509, 1 ],
      [ 1013, 376, 0 ],
      [ 1013, 471, 0 ],
      [ 1108, 424, 0 ],
      [ 1098, 319, 1 ],
      [ 1203, 424, 0 ],
      [ 1288, 414, 1 ],
      [ 1393, 376, 0 ],
      [ 1393, 471, 0 ],
      [ 1478, 414, 1 ],
      
      [ 480, 509, 1 ],
      [ 585, 566, 0 ],
      [ 490, 614, 0 ],
      [ 717, 556, 1 ],
      [ 822, 566, 0 ],
      
      [ 252, 519, 0 ],
      [ 394, 566, 0 ],
      [ 347, 662, 0 ],
      [ 490, 709, 0 ],
      [ 480, 794, 1 ],
      [ 632, 662, 0 ],
      [ 632, 757, 0 ],
      [ 727, 709, 0 ],
      [ 717, 794, 1 ],
      [ 822, 662, 0 ],
      [ 822, 757, 0 ],
      [ 918, 709, 0 ],
      [ 908, 794, 1 ],
      [ 1013, 662, 0 ],
      [ 1013, 757, 0 ],
      [ 1108, 709, 0 ],
      [ 1108, 804, 0 ],
      [ 1192, 794, 1 ],
      [ 1202, 709, 0 ],
      [ 1192, 604, 1 ],
      [ 1288, 652, 1 ],
      [ 1393, 614, 0 ],
      [ 1393, 709, 0 ],
      [ 1478, 652, 1 ]
    ],
    
    technomancer: [
      [ 107, 374, 2 ],
      
      [ 252, 329, 0 ],
      [ 347, 186, 0 ],
      [ 394, 281, 0 ],
      [ 490, 138, 0 ],
      [ 480, 33, 1 ],
      [ 632, 91, 0 ],
      [ 632, 186, 0 ],
      [ 727, 138, 0 ],
      [ 717, 33, 1 ],
      [ 822, 91, 0 ],
      [ 822, 186, 0 ],
      [ 918, 138, 0 ],
      [ 908, 33, 1 ],
      [ 1013, 91, 0 ],
      [ 1013, 186, 0 ],
      [ 1108, 138, 0 ],
      [ 1098, 224, 1 ],
      [ 1202, 138, 0 ],
      [ 1193, 33, 1 ],
      [ 1288, 176, 1 ],
      [ 1393, 138, 0 ],
      [ 1393, 234, 0 ],
      [ 1478, 176, 1 ],
      
      [ 490, 234, 0 ],
      [ 480, 319, 1 ],
      [ 585, 281, 0 ],
      [ 717, 271, 1 ],
      [ 822, 281, 0 ],
      
      [ 299, 424, 0 ],
      [ 394, 376, 0 ],
      [ 394, 471, 0 ],
      [ 490, 424, 0 ],
      [ 632, 376, 0 ],
      [ 632, 471, 0 ],
      [ 727, 424, 0 ],
      [ 822, 376, 0 ],
      [ 822, 471, 0 ],
      [ 918, 424, 0 ],
      [ 908, 319, 1 ],
      [ 908, 509, 1 ],
      [ 1013, 566, 0 ],
      [ 1013, 376, 0 ],
      [ 1013, 471, 0 ],
      [ 1108, 424, 0 ],
      [ 1203, 424, 0 ],
      [ 1193, 319, 1 ],
      [ 1288, 414, 1 ],
      [ 1393, 376, 0 ],
      [ 1393, 471, 0 ],
      [ 1478, 414, 1 ],
      
      [ 480, 509, 1 ],
      [ 585, 566, 0 ],
      [ 490, 614, 0 ],
      [ 717, 556, 1 ],
      
      [ 252, 519, 0 ],
      [ 394, 566, 0 ],
      [ 347, 662, 0 ],
      [ 490, 709, 0 ],
      [ 480, 794, 1 ],
      [ 632, 662, 0 ],
      [ 632, 757, 0 ],
      [ 727, 709, 0 ],
      [ 717, 794, 1 ],
      [ 822, 662, 0 ],
      [ 822, 757, 0 ],
      [ 918, 709, 0 ],
      [ 908, 794, 1 ],
      [ 1013, 662, 0 ],
      [ 1013, 757, 0 ],
      [ 1108, 709, 0 ],
      [ 1108, 804, 0 ],
      [ 1192, 794, 1 ],
      [ 1202, 709, 0 ],
      [ 1192, 604, 1 ],
      [ 1288, 652, 1 ],
      [ 1393, 614, 0 ],
      [ 1393, 709, 0 ],
      [ 1478, 652, 1 ]
    ]
  }
  
  //---------------------------------------- Load Nodes
  $.each(allcoords, (c, coords) => {
    let nodes = $("." + c + ".skilltree .nodes")
    $.each(coords, (i, node) => {
      nodes.append($("<div>").addClass("node n" + node[2]).css({ left: node[0], top: node[1] }))
    })
  })
  
  //---------------------------------------- Load Stats & Tooltips
  let keywords = {
    "hl-a": /(アノマリーパワー)/gi,
    "hl-d": /((武器|アサルト|短射程|長射程|)ダメージ|火力|(～?\d+(\.\d+)?%|3\.5|9|\[[xyz]\]%?|火力))/gi,
    "hl-e": /(弱体化(効果)?|脆弱(効果|ility)|マーク|炎上(中)?|灰燼(後)?|出血(効果)?|毒(効果)?|氷結(効果)?|frozen)/gi,
    "hl-h": /((最大)?体力(回復量|吸収量)?|スキル耐久力)/gi,
    "hl-l": /(^\[hm\]|(武器による|スキルによる)体力吸収量)/gi,
    "hl-n": /((「コンセントレーション|「マグマ・ゴーレム|「アノマリーの恩師|「衝撃増幅器)」ノード|エリート)/gi,
    "hl-p": /((アーマー|(アーマーと)?耐性)貫通)/gi,
    "hl-r": /((アーマー|耐性)(?!(と耐性)?貫通)|ダメージ低減)/gi,
    "hl-s": /(近接攻撃アビリティ|近接攻撃スキル|(攻撃属性|策略属性|移動属性|発火属性|行動不能属性|爆発属性|防衛属性|地震属性|起動属性|腐敗属性|兵器属性|装置属性|近接|any)のスキル?|stone push|(?<=スキル(クールダウン|ダメージ) \()(ダメージ|策略属性|移動属性|発火属性|行動不能|爆発属性|防衛属性|地震属性|起動属性|腐敗属性|兵器属性|装置属性|タレット|any))/gi,
    "hl-t": /(シールド?( degredation| gain)?)/gi
  }
  
  
  stats = {
    trickster: {},
    pyromancer: {},
    devastator: {},
    technomancer: {}
  }
  
  $.each(skills, (c, list) => {
    let skilltree = $("." + c + ".skilltree")
    let statstable = $("." + c + ".statstable")
    let s = []
    let u = []
    $.each(list, (i, node) => {
      let t = []
      $.each(node[4], (k, v) => {
        if (!stats[c][k]) {
          stats[c][k] = [ 0, v, 0, 1 ]
        }
        else {
          stats[c][k][1] += v
          stats[c][k][3]++
        }
        
        if (v) {
          if (!s.includes(k)) {
            s.push(k)
          }
          t.push(+(v * 100).toFixed(1) + "% " + k)
        }
        else {
          if (!u.includes(k)) {
            u.push(k)
          }
          t.push(k)
        }
      })
      let tooltip = $("<ul>")
      $.each(t, (j, v) => {
        tooltip.append($("<li>").html(color(v, keywords)))
      })
      $(".node", skilltree).eq(i)
        .append($("<div>").addClass("name").text(node[3]))
        .append($("<div>").addClass("tooltip")
          .append(tooltip))
    })
    
    //--- Create sorted stat list
    $.each(s.sort((a, b) => a.toLowerCase().localeCompare(b.toLowerCase())), (i, v) => {
      $("table", statstable).first()
        .append($("<tr>").addClass("stat inactive").attr("data-s", v)
          .append($("<td>").addClass("stat-k").text(v + ":"))
          .append($("<td>").addClass("stat-v").text("0%"))
          .append($("<td>").addClass("stat-m").text(+(stats[c][v][1] * 100).toFixed(1) + "%"))
          .append($("<td>").addClass("stat-n").html("(<span class=\"stat-c\">0</span>/" + stats[c][v][3] + ")")))
    })
    //--- Create sorted stat list (Unique stats)
    $.each(u.sort((a, b) => a.toLowerCase().localeCompare(b.toLowerCase())), (i, v) => {
      $("table", statstable).last()
        .append($("<tr>").addClass("stat inactive").attr("data-s", v)
          .append($("<td>").html(color(v, keywords))))
    })
  })
      
  //--- Unique Node Skill Count
  $(".stat[data-s='Increase アサルトダメージ by 7% for each unlocked コンセントレーション ノード'] td").append(" (<span class=\"unique\" data-c=\"0\" data-v=\"0.07\">0%</span>)")
  $(".stat[data-s='Increase アノマリーパワー by 2.5% for each unlocked マグマ・ゴーレム ノード'] td").append(" (<span class=\"unique\" data-c=\"0\" data-v=\"0.025\">0%</span>)")
  $(".stat[data-s='Increase 武器ダメージ by 10% for each unlocked アノマリーの恩師 ノード'] td").append(" (<span class=\"unique\" data-c=\"0\" data-v=\"0.1\">0%</span>)")
  $(".stat[data-s='Increase アノマリーパワー by 4% for each unlocked 衝撃増幅器 ノード'] td").append(" (<span class=\"unique\" data-c=\"0\" data-v=\"0.04\">0%</span>)")
  
  //---------------------------------------- Load Abilities
  abilities = {
    trickster: {
      攻撃属性: {
        "テンポラル・ブレード": 20,
        "ツイステッド・ラウンド": 20,
        "サイクロンスライス": 0,
      },
      策略属性: {
        "スロートラップ": 31,
        "ヴェネターナイフ": 0,
        "タイムリフト": 0
      },
      移動属性: {
        "ハント・ザ・プレイ": 11,
        "バーロウ・タイム": 0
      }
    },
    pyromancer: {
      爆発属性: {
        "サーマル・ボム": 14,
        "オーバーヒート": 22,
        "エラプション": 0
      },
      発火属性: {
        "ヒートウェーブ": 13,
        "ヴォルカニック・ラウンド": 0,
        "F.A.S.E.Rビーム": 0
      },
      行動不能属性: {
        "フィード・ザ・フレイム": 17,
        "アッシュブラスト": 0
      }
    },
    devastator: {
      起動属性: {
        "グラビティ・リープ": 20,
        "ボルダーダッシュ": 0,
        "エンドレス・マス": 0
      },
      防衛属性: {
        "ゴーレム": 26
      },
      地震属性: {
        "アースクエイク": 14,
        "リフレクト・バレット": 22,
        "インペイル": 0,
        "トレマー": 0
      }
    },
    technomancer: {
      腐敗属性: {
        "ブライテッド・ラウンド": 58,
        "ブライテッド・タレット": 0
      },
      装置属性: {
        "クライオ・タレット": 24,
        "フィックシング・ウェーブ": 0,
        "コールド・スナップ": 0
      },
      兵器属性: {
        "スクラップネル": 22,
        "ペインランチャー": 40,
        "ディストラクション・ツール": 0
      }
    }
  }
  
  cooldowns = {
    攻撃属性: 1,
    策略属性: 1,
    移動属性: 1,
    爆発属性: 1,
    発火属性: 1,
    行動不能属性: 1,
    起動属性: 1,
    防衛属性: 1,
    地震属性: 1,
    腐敗属性: 1,
    装置属性: 1,
    兵器属性: 1
  }
  
  let abilitydesc = {
    trickster: {
      "テンポラル・ブレード": "前方にいる全ての敵に斬りつけて麻痺される。～86%ダメージおよびスロー効果を与え、さらに妨害を行う。",
      "スロートラップ": "時空を歪めるアノマリーの空間を発生させ、敵および銃弾・砲弾に10秒間スロー効果を与える。",
      "ハント・ザ・プレイ": "選択した敵1体の背後へテレポートし、～19%シールドを獲得する。",
      "ツイステッド・ラウンド": "装備中の武器のマガジンにアノマリーが宿った弾薬を装填し、火力が～65%上昇する。このスキル効果はリロードまたは武器交換時まで持続する。",
      "サイクロンスライス": "アノマリーブレードの旋風を起こし、ヒットするたびに自分の小半径内の敵に[Z]ダメージとインタラプトを与える。このスキルは[X]秒間持続する。",
      "ヴェネターナイフ": "テンポラリーナイフを敵に投げつける。刃は小半径内の最大[Y]人の敵の間で跳ね返り、[Z]ダメージを与え、マーキングする。マークされた対象にはスローが付与され、[X]秒間、最初に与えたダメージが2倍になる。",
      "タイムリフト": "敵を空中に浮遊させる衝撃波を発生させ、3.5秒間戦闘不能にして弱体化を与える。",
      "バーロウ・タイム": "[X]シールドを受け取り、[Y]秒間、自分の位置をマークする。再度スキルを発動すると、時空を曲げてマークされた場所にテレポートする。",
    },
    pyromancer: {
      "ヒートウェーブ": "炎の波を発生させ、飲み込まれた全ての敵に～17.5%ダメージと炎上効果を与える。",
      "フィード・ザ・フレイム": "選択した敵1体を自身の方へ引き寄せ、～25%ダメージを与え～25%体力を吸収し、さらに灰塵効果を与える",
      "サーマル・ボム": "選択した敵1体に炎上効果を与えて妨害を行い、さらに～13%ダメージを与える。このスキルの効果を受けている状態で敵が死亡した場合、爆発して広範囲に～112%ダメージを与える。",
      "オーバーヒート": "広範囲の敵に～3.7%ダメージを与え、スキルを妨害する。ただし、炎上状態の敵は上記のダメージではなく～45%ダメージを受ける（その後、炎上効果は消滅する）。",
      "ヴォルカニック・ラウンド": "現在使用している武器のマガジンに、敵の周囲の空気に点火し、弾が外れても敵に炎上効果を与える弾丸を充填します。弾が命中した場合はスキルダメージを与え、アーマーを無視してターゲットを貫通し、後ろの人にもダメージを与えます。このスキルは、リロードするか武器を持ち替えるまで持続する。",
      "エラプション": "選択した敵の下に火山の噴火を起こし、ターゲットの小半径内の全ての敵に[Z]ダメージを与える。噴火は溶岩を噴出し、小範囲内で時間をかけてダメージを与える。",
      "F.A.S.E.Rビーム": "ステータスパワーの[X]%の恩恵を受ける[Z]ダメージを与えるエネルギービームを発射し、ビームが当たった敵と、自分を中心とした小範囲の敵に火傷と割り込みを与える。",
      "アッシュブラスト": "アノマリーブラストを発生させ、自分を中心とした大きな半径内のすべての敵にアッシュを与える。",
    },
    devastator: {
      "アースクエイク": "衝撃波を放ち、前方にいる全ての敵に～40%ダメージを与え、さらに妨害を行う。",
      "ゴーレム": "防御力が上昇し、受けるダメージが8秒間65%低下する。",
      "グラビティ・リープ": "空高く飛んで空中から標的を攻撃し、着地した場所から小規模の範囲内にいる敵に～80%ダメージを与え妨害を行う",
      "リフレクト・バレット": "バリアを発生させ、全ての砲弾を受け止めダメージを蓄積させる。発動から10秒後に、蓄積されたダメージを敵へ跳ね返す。また、バリアは近接攻撃も防ぎ、ダメージの一部を敵に跳ね返す。",
      "インペイル": "ターゲットを選択して、相手のスキルを中断し、出血効果を与え、[Z]ダメージを与える。致命的なダメージを与えた場合、敵はインペイルされ、9秒間味方全員にアーマーと体力の再生に強力なボーナスを与える。",
      "ボルダーダッシュ": "前方にチャージして、進路上のすべての敵を中断させ、[Z]ダメージを与える。チャージ終了時には地面を粉砕し、周囲の小範囲の敵全てに[Z]ダメージを与える。",
      "エンドレス・マス": "ターゲットを選択して石で包み込み、ブリードを与え、小半径内の敵を最初のターゲットに引き寄せる。その後、石が爆発し、ターゲットの周囲の小範囲にいるすべての敵に[Z]ダメージを与える。",
      "トレマー": "自分の周りに一連の爆発を発生させ、それぞれが[Z]ダメージを与え、自分の周りの中半径内の敵から[X]体力を排出する。",
    },
    technomancer: {
      "スクラップネル": "近接反応地雷を設置する。爆発時に範囲内にいる敵に～77%ダメージを与えてスキルの妨害を行う。",
      "クライオ・タレット": "自動で動くタレットを設置して、敵に～2%ダメージおよび氷結効果を与える。タレットの耐久力は時間経過もしくは敵からのダメージで減少する。",
      "ペインランチャー": "ミサイルランチャーを設置して、前方のエリアを爆撃する。1発当たり～13%ダメージを与え、さらに敵のスキルを妨害する。",
      "ブライテッド・ラウンド": "装備中の武器のマガジンに毒の弾薬を装填し、標的に毒効果を与える。また、その標的から小規模の範囲内の敵にも、毒効果および50%のダメージを与える。このスキル効果はリロードまたは武器交換時まで持続する。",
      "ディストラクション・ツール": "２つのモードを選べる。<br>スキルボタンを短く押すとロケットランチャーが生成され、[X]ダメージとスキルの妨害を与える</br>スキルボタンを長押しするとガトリング砲が生成され、1発につき[Z]ダメージを与える。",
      "フィックシング・ウェーブ": "ゲーム中唯一のエリアヒール能力です。自分や味方の体力を33%回復し、ガジェットの耐久力を50%回復させます。",
      "コールド・スナップ": "ガジェットをドロップすると、自分を中心とした大きな半径内のすべての敵に氷結効果を与える。",
      "ブライテッド・タレット": "敵に[Z]ダメージを与え、毒を与える自動砲台を配置する。砲台の耐久力は、時間の経過やダメージを受けたときにゆっくりと減少します。",
    }
  }

  let abilitykeywords = {
    "hl-d": /(～?\d+(\.\d+)?%|3\.5|9|\[[xyz]\]%?|火力)/gi,
    "hl-e": /(弱体化|炎上(効果)?|灰燼(効果)?|出血(効果)?|毒(効果)?|氷結(効果)?)/gi,
    "hl-h": /(体力|耐久力(吸収量)?)/gi,
    "hl-n": /(妨害(効果|中)?)/gi,
    "hl-r": /(アーマー)/gi,
    "hl-s": /(ロケットランチャー|ミニガン)/gi,
    "hl-t": /(シールド)/gi
  }

  $.each(abilities, (c, types) => {
    let statstable = $("." + c + ".statstable .cooldowns")
    let i = 1
    $.each(types, (type, list) => {
      let activetype = $("<div>")
      statstable.append(activetype.append($("<div>").addClass("powertype").text(type)))
      $.each(list, (name, cd) => {
        activetype.append($("<div>").addClass("power").attr("data-i", i++).attr("data-n", name)
          .append($("<div>").text(name))
          .append($("<img>").attr({ src: "skills/" + name.replace(/ /g, "-").toLowerCase() + ".jpg", width: "64px", height: "64px", onerror: "this.onerror = null; this.src='skills/placeholder.webp'" }))
          .append($("<div>").addClass("cooldown").text(cd))
          .append($("<div>").addClass("tooltip").html(color(abilitydesc[c][name], abilitykeywords))))
      })
    })
  })
}
